[
    {
        "jobId": "3648431448",
        "jobUrl": "https://www.linkedin.com/jobs/view/3648431448",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:2004",
            "companyName": "NASA Jet Propulsion Laboratory",
            "companyUrl": "https://www.linkedin.com/company/jet-propulsion-laboratory"
        },
        "description": "Job Details\nNew ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.\nLocated in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.\nDo you live to code, love problem solving, analyzing data and technical challenges? Do you enjoy interacting with business partners and domain experts to understand their business problems and needs, then conveying the passion and expertise to transform these problems or needs from requirements to technical solutions that deliver value? We are looking for technical talent to do just that!\nThis opportunity seeks an Enterprise Software Engineer within the Enterprise Business Information Services (EBIS) Division joining a dedicated team of IT professionals in the Project and Institutional Financial Information Services Section. The new team member will have opportunities to innovate and apply technologies across a spectrum of industry standard methodologies in financials, project controls and contracts business domains. In this highly impactful, far-reaching role, you can demonstrate highly collaborative behavior, be results-oriented, and exhibit domain expertise whose experiences couple both technology and business sense. The ideal candidate works independently and in collaboration with other team members, is analytical, applies judgment, and has multi-tasking skills to successfully support the business systems needs of both internal and external customers, including the timely accomplishment of performance, delivery, and schedule landmarks.\nThe EBIS Division maintains stewardship over the ever-evolving Business IT portfolio of applications and systems required to support JPL's robust and complex business processes. EBIS manages the full system lifecycle across all major business processes, provides analytical and technical services, and strategically partners with the Laboratory's business community to ensure continuous delivery of business IT services. Key initiatives include a business intelligence program, data analytics, and embracing agile methodologies and tools. This position could be a remote.\nQualifications:\nBachelor degree with at least 3 years’ experience or Master’s degree with 1 year of related experience in Computer Information Systems, Computer Science, Business Information Systems or related disciplines\nJob Requirements:\nElicit and collect relevant requirements and help users discover their real business needsParticipate in software feasibility and trade studiesBuild use cases, generate user stories, test scripts and test plansDesign, setup, develop and test business software applications and interface solutions that will be delivered into JPL’s enterprise computing system environment according to JPL/EBIS software development standardsCoordinate and communicate system upgrades, new features and changes to users and business process ownersParticipate in technologies evaluation and recommend solutions to optimize IT and business processesAnalyze and resolve technical/functional production issuesWork with users to gain understanding of business processesRemain in regular contact with users throughout the project to present prototypes, conduct demos, problem solve, allay concerns, validate requirements, etc.Craft intuitive and visually appealing user interfaces and dashboardsProvide estimates and schedules to project managementHelp drive our products to greatnessKeep our products fresh and relevant by proposing improvements as business needs change, or as new features become available\nSkills:\nHas experience in some of these areas: SQL, Oracle PL/SQL, Shell Scripts, JSON, XML, Python, Java, JavaScript, Angular, Node.js, HTML5, or CSSAbility to communicate ideas, instructions, and requirements clearly and concisely; ability to tell a storyHas experience building APIs and services using REST, SOAP, etc.Analytical and problem-solving skillsAbility to translate requirements into business system solutionsAbility to build prototypes and mockupsA self-starter with the ability to think creatively and to work well as part of a diverse team and as an individual contributorGood interpersonal skills, integrity and self-awareness, to communicate comfortably with all levels of staff and managementSuperb writing and presentation skills\nDesired Skills\nFamiliarity with software development methodologies including waterfall and agile/scrumFamiliarity with data security methods and safe guarding different classification of information, both in place and in transitFamiliarity with basic toolsets that support development, such as Jira and GitHubFamiliarity of continuous integration, continuous delivery (CI/CD)Experience with or desire to learn one or more of the following: EVMS/Project Controls System, Oracle eBS (Financials or Projects), Contract Lifecycle Management System, or MS Project Server\nJPL has a catalog of benefits and perks that span from the traditional to the unique. This includes a variety of health, dental, vision, wellbeing, and retirement plans, paid time off, learning, rideshare, childcare, flexible schedule, parental leave and many more. Our focus is on work-life balance, and living healthy, fulfilling lives as we Dare Mighty Things Together. For benefits eligible positions, benefits are effective the first day of the month coincident with or immediately following the employee’s start date.\nFor further benefits information click Benefits and Perks\nThe hiring range displayed below is specifically for those who will work in or reside in the location listed. In extending an offer, Jet Propulsion Laboratory considers factors including, but not limited to, the candidate’s job related skills, experience, knowledge, and relevant education/training. Hiring range for this job may be adjusted based on primary work location outside of Pasadena, California. This adjusted range will be provided to candidates by the Recruiter when applicable.\nThe typical full time equivalent annual hiring range for this job in Pasadena, California.\n$112,070 - $122,096\nJPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.\nIn addition, JPL is a VEVRAA Federal Contractor.\nEEO is the Law.\nEEO is the Law Supplement\nPay Transparency Nondiscrimination Provision\nThe Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are U.S. Citizens, Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available here.",
        "title": "Business Application Developer",
        "postTime": "2023-09-04 02:10:41 PDT",
        "postTimeSeconds": 1693818641.0
    },
    {
        "jobId": "3710258418",
        "jobUrl": "https://www.linkedin.com/jobs/view/3710258418",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:2646",
            "companyName": "Walmart",
            "companyUrl": "https://www.linkedin.com/company/walmart"
        },
        "description": "Position Summary...\nWhat you'll do...\nAs a Software Engineer in Operations, you will create/ develop and own the monitoring framework which interfaces with various applications. You will work closely with Developers/Product/Business in various teams in supporting new applications features, services launch and manage application using automated deployment tools. You will monitor, support and deploy our multi-tenant solutions.\nAbout Team\nOur team works closely with our US stores and eCommerce business to better serve customers by empowering team members, stores, and merchants with technological innovation. From groceries and entertainment to sporting goods and crafts, Walmart U.S. offers an extensive selection that our customers value, whether they shop online at Walmart.com, through one of our mobile apps, or in-store. Focus areas include customers, stores and employees, in-store service, merchant tools, merchant data science, and search and personalization.\nWhat You'll Do\nIdentifying short- and long-term solutions and timeline; reviewing and providing feedback for proposed solutions; and performing design and code reviews of changes.Full stack development using multiple technologies like reactjs, Java, Kafka, SQL and No SQL DB'sProvides and supports the implementation of business solutions by building relationships and partnerships with key stakeholders; identifying business needs; determining and carrying out necessary processes and practices; monitoring progress and results; recognizing and capitalizing on improvement opportunities; and adapting to competing demands, organizational changes, and new responsibilities.Build and maintain tools for deployment, monitoring and operations. Develop efficient code to automate repetitive/manual tasks.Continuously research existing systems to find more efficient/ automated ways of preventing, minimizing or resolving issues..\nWhat You'll Bring\nBachelor degree in computer science is preferred or 2+ years of experience in the software engineering field with exposure to supply chain or retail operations or enterprise systemsProgramming expertise on Java 8, Shell Scripting, .NETSQL and no-SQL Databases such as MongoDB, MS SQL, Cassandra, Cosmos DB, AZURE SQL, ElasticKnowledge on EM IOT Platform - edge platformData Engineering - Scala/Pyspark/Spark/SQL/Cloud - azure/GCMonitoring & Alerting tools such as Splunk, Medusa, KibanaRunning infrastructure with public or private cloud environments and platforms like Azure, Kubernetes, Dockers\nAbout Walmart Global Tech\nImagine working in an environment where one line of code can make life easier for hundreds of millions of people. That's what we do at Walmart Global Tech. We're a team of software engineers, data scientists, cybersecurity expert's and service professionals within the world's leading retailer who make an epic impact and are at the forefront of the next retail disruption. People are why we innovate, and people power our innovations. We are people-led and tech-empowered. We train our team in the skillsets of the future and bring in experts like you to help us grow. We have roles for those chasing their first opportunity as well as those looking for the opportunity that will define their career. Here, you can kickstart a great career in tech, gain new skills and experience for virtually every industry, or leverage your expertise to innovate at scale, impact millions and reimagine the future of retail.\nFlexible, Hybrid Work\nWe use a hybrid way of working that is primarily in office coupled with virtual when not onsite. Our campuses serve as a hub to enhance collaboration, bring us together for purpose and deliver on business needs. This approach helps us make quicker decisions, remove location barriers across our global team and be more flexible in our personal lives.\nBenefits\nBenefits: Beyond our great compensation package, you can receive incentive awards for your performance. Other great perks include 401(k) match, stock purchase plan, paid maternity and parental leave, PTO, multiple health plans, and much more.\nEqual Opportunity Employer\nWalmart, Inc. is an Equal Opportunity Employer - By Choice. We believe we are best equipped to help our associates, customers and the communities we serve live better when we really know them. That means understanding, respecting and valuing diversity- unique styles, experiences, identities, ideas and opinions while being inclusive of all people.\nThe above information has been designed to indicate the general nature and level of work performed in the role. It is not designed to contain or be interpreted as a comprehensive inventory of all responsibilities and qualifications required of employees assigned to this job. The full Job Description can be made available as part of the hiring process.\nMinimum Qualifications...\nOutlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.\nOption 1: Bachelor's degree in computer science, computer engineering, computer information systems, software engineering, or related area.Option 2: 3 years' experience in software engineering or related area.\nPreferred Qualifications...\nOutlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.\nCertification in Security+, Network+, GISF, or GSEC\nPrimary Location...\n805 SE MOBERLY LN, BENTONVILLE, AR 72712, United States of America",
        "title": "(USA) Software Engineer II",
        "postTime": "2023-09-04 16:05:48 PDT",
        "postTimeSeconds": 1693868748.0
    },
    {
        "jobId": "3649653633",
        "jobUrl": "https://www.linkedin.com/jobs/view/3649653633",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:446072",
            "companyName": "Colony Brands, Inc.",
            "companyUrl": "https://www.linkedin.com/company/colony-brands-inc-"
        },
        "description": "As a Cloud Data Engineer, you will be responsible for providing data and software development leadership, defining and implementing modern, flexible software architectures, and leveraging cloud computing, big data technologies, and DevOps practices in an AWS environment. Your role will involve designing and optimizing data pipelines, ensuring real-time processing and analysis, and driving data-driven decision-making.In addition, you will:• Work with large sets of data from Operational data sources on and off premises• Develop secure and efficient processes, utilizing various software applications• Streamline and expedite the transformation and integration of data into various tools for reporting.• Troubleshoot issues, validate solutions, and recommend and implement data pipeline improvements.\nQualifications• BS in Computer Science or related field• 2+ years of experience in modern programming languages preferred. (Python and SQL are required)• Knowledge of PySpark, Apache (Flink, Kafka, & Spark) is preferred• Experience using cloud-based technologies such as AWS (preferred), Azure, or Google Cloud• Knowledge of AWS database services (primarily Redshift, RDS, & Dynamo)• Knowledge of C# or C+, Java, ETL, is helpful• Knowledge of AI chatbot services such as ChatGPT, Bard, etc.• Experience with client server applications, web-based applications, software integration, and database/data modeling design.• Proven ability to master new technologies.• Excellent communication, prioritization, and problem-solving skills.• Strong analytical capabilities with a creative and innovative approach to solutions.• Ability to ensure that solutions are secure, efficient, scalable, and supportable.• Ability to communicate in business terms and build a strong relationship with stakeholders.\nNote: This position is not eligible for Visa Sponsorship.",
        "title": "Cloud Data Engineer",
        "postTime": "2023-09-04 17:00:00 PDT",
        "postTimeSeconds": 1693872000.0
    },
    {
        "jobId": "3628316854",
        "jobUrl": "https://www.linkedin.com/jobs/view/3628316854",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:1586",
            "companyName": "Amazon",
            "companyUrl": "https://www.linkedin.com/company/amazon"
        },
        "description": "Description\nProject Kuiper is an initiative to launch a constellation of low earth orbit satellites that will provide low-latency, high-speed broadband internet connectivity to un-served and under-served communities around the world. In this role as a SDE-II, you will be part of the core technical team building the network infrastructure for satellite to ground based connectivity. This opportunity will afford you an exciting SDE leadership role in Project Kuiper that would enable you drive the engineering culture of the team.\nKey job responsibilities\n You will collaborate with engineers across the org to gather requirements, design, develop, deploy, and operate across solution pipelines. You will work on initiatives building networking functions on AWS infrastructure and help implement best practices for software development. You will develop code, build CI/CD pipelines, test automation, and dashboards for monitoring health of systems and data pipelines. You will help engineer and build solutions which are required for provisioning, address management, packet inspection and dynamic traffic management for Internet service providers.\nEligibility Requirements\nDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\nA day in the life\nA SDE in Kuiper Network Services is responsible for designing, developing, testing, deploying, and operating services that enable broadband networks systems worldwide. We write code, debug, and create the world’s most innovative products. We work in collaboration with other teams for designing and delivering scalable, flexible, low latency, and high throughput network functions. We develop flexible and cost-effective solutions in support of connecting and peering with public and private networks.\nAbout The Team\nKuiper Network’s goal to connect users around the world, is a commitment to not just establish networks but to connect customers to services. These services enable customer terminals and applications the ability to interface with the larger world. Our services come into focus for each Kuiper subscriber at activation from address assignment and name resolution to secure and programmable network functions. The Network Services team walks backward from end-user’s perspective as we design and develop network functions that serve their unique asks.\nWe are open to hiring candidates to work out of one of the following locations:\nRedmond, WA, USA\nBasic Qualifications\n 3+ years of non-internship professional software development experience 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience Experience programming with at least one software programming language Bachelor's degree in computer science or related technical discipline with more than 3+ years of experience in building large scale solutions solutions. Experience in professional software development, building large-scale, high performance systems and networking solutions in using C++/Java, Java script, Node.js, React, Rust in a Linux/Unix environment. With relevant experience working on system design for multi-tiered or distributed systems in an engineering team.\nPreferred Qualifications\n 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience Bachelor's degree in computer science or equivalent Experience in Networking system design and development. Experience in developing network functions on major cloud systems like AWS, Google Cloud, or Azure. Experience in building Capacity, Performance, and Fault Management for large scale high availability systems. Foundation in data structures and algorithms, with advanced knowledge of IP communication technologies. Experience with network analysis fundamentals and robust troubleshooting skills; specifically, network performance analysis. Extensive Unix/Linux based system programming experience (e.g. sockets,files, shared memory) and understanding of Operating systems. Expertise in wireless and mobile networking is welcome but is not a mandatory requirement.\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\nPursuant to the Los Angeles Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $115,000/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. Applicants should apply via our internal or external career site.\nCompany - Amazon Kuiper Manufacturing Enterprises LLC\nJob ID: A2354133",
        "title": "Software Development Engineer II, Kuiper Network Services",
        "postTime": "2023-09-04 06:44:53 PDT",
        "postTimeSeconds": 1693835093.0
    },
    {
        "jobId": "3711088958",
        "jobUrl": "https://www.linkedin.com/jobs/view/3711088958",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:69929",
            "companyName": "Noir",
            "companyUrl": "https://www.linkedin.com/company/noir-consulting"
        },
        "description": ".NET Software Engineer, .NET 7, C#, Agile - Austin\n(Tech stack: .NET Software Engineer, .NET 7, ASP.NET, C#, React, Angular 14, Microservices, Vue.js, TypeScript, Azure, Web API 2, Agile, SQL Server 2022, Programmer, Full Stack Developer, Architect, .NET Software Engineer)\nWe’re pleased to announce the arrival in Austin, Texas of one of Silicon Valley’s most successful and exciting brands. They’re at the heart of the Internet, helping the most innovative companies remove the complexities of delivering any experience, to any device, anywhere.\nHaving setup an R&D centre in Austin, Texas they are looking to hire several .NET Software Engineer at all levels who are passionate about developing revolutionary software solutions. .NET Software Engineer applicants should have commercial experience with: .NET, .NET Core / ASP.NET MVC, C#, SQL Server and Agile. Full training will be provided into: .NET 7, JavaScript, React, Angular 14, Microservices, MongoDB, Vue.js, TypeScript, Azure, AWS, Web API 2, Entity Framework, Node.js, Elasticsearch, Agile, TDD, BDD, Scrum, Kanban and SQL Server 2022.\nIf you’re dedicated to the youthful optimism of problem solving through intellectual curiosity, collaboration and commitment this could be the role for you. Our client is growing quickly. If you’d like to work in a culture where hard work and innovative ideas are consistently rewarded, join them and help shape the future of the hyperconnected world.\nLocation: Austin, Texas, USA / Remote Working\nSalary: $140,000 - $170,000 + Bonus + Benefits\nNoir continues to be the leading Microsoft recruitment agency; we can help you make the right career decisions!\nNOIRUSANETRECNOIRUSAREC",
        "title": ".NET Software Engineer - Austin",
        "postTime": "2023-09-04 02:15:43 PDT",
        "postTimeSeconds": 1693818943.0
    },
    {
        "jobId": "3641852289",
        "jobUrl": "https://www.linkedin.com/jobs/view/3641852289",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:510820",
            "companyName": "TekSynap",
            "companyUrl": "https://www.linkedin.com/company/teksynap"
        },
        "description": "Responsibilities & Qualifications\n RESPONSIBILITIES \n Responsible for effective provisioning, operation, installation/configuration and maintenance of systems hardware/software/related infrastructure.  Provide technical support, guidance and hands-on delivery in the planning, implementation and ongoing operations.  The Systems Engineer shall participate in technical research and development to enable continuing innovation within the infrastructure.  Ensure that system hardware, operating systems, software systems, and related procedures adhere to organizational values and regulatory requirements.  The Systems Engineer shall document specifications, project plans, configurations, test plans and results. \nRequired Qualifications Five (5) years of overall professional experience in the engineering field.  Two (2) years hands-on experience with enterprise SAN (Storage Area Network) management to include capabilities and technologies such as: Fiber Channel zoning, FCoE (Fiber Channel over Ethernet) unified fabric, HBA/CNA (Host Bus Adapter/Converged Network Adapter), storage controllers, and LUN (Logical Unit Number), RAID (Redundant Array of Independent Disks), and file sharing / NAS (Network Addressable Storage).  Five (5) years hands-on experience with enterprise hierarchical storage system management; operation of enterprise backup/restore services, using software such as Veritas NetBackup.  Two (2) years hands-on experience with Azure Recovery Services (ARS).  Must have at least five (5) years of experience working with DOD IT systems  Active Secret clearance with IT-II sensitivity  One of the following active IAT II or III certifications: Security+ CE  CASP+ CE  CCNA Security  CySA+  GICSP  GSEC  SSCP  CCNP Security  CISA  CISSP (or Associate)  GCED  GCIH  One of the following active Computing Environment: Dell EMC Information Storage and Management (DECA-ISM)  Hitachi Vantara Qualified Professional – Storage Administration  NetApp Certified Data Administrator (NCDA)  SNIA Storage Networking Certification Program (SNCP)  EMC Data Domain Specialist \nOverview\nWe are seeking a Systems Engineer to join our team supporting DLA Storage & Backup in Tracy, CA, Columbus, OH, Dayton, OH or Richmond, VA.\nTekSynap is a fast growing high-tech company that understands both the pace of technology today and the need to have a comprehensive well planned information management environment. “Technology moving at the speed of thought” embodies these principles – the need to nimbly utilize the best that information technology offers to meet the business needs of our Federal Government customers.\nWe offer our full-time employees a competitive benefits package to include health, dental, vision, 401K, life insurance, short-term and long-term disability plans, vacation time and holidays.\nVisit us at www.TekSynap.com .\nApply now to explore jobs with us!\nThe safety and health of our employees is of the utmost importance. Employees are required to comply with any vaccination requirements mandated by contract, applicable law or regulation.\nBy applying to a role at TekSynap you are providing consent to receive text messages regarding your interview and employment status. If at any time you would like to opt out of text messaging, respond \"STOP\".\nAdditional Job Information\nCOMPETENCIES \n Establish Focus  Change Management  Develop Others  Oral Communication  Written Communication  Interpersonal Awareness  Build Relationships  Analytical Thinking  Conceptual Thinking  Strategic Thinking  Technical Expertise  Initiative  Foster Innovation  Results Oriented  Teamwork  Customer Service \nWORK ENVIRONMENT AND PHYSICAL DEMANDS\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of the job. Reasonable accommodation may be made to enable individuals with disabilities to perform the essential functions.\n Location: Tracy, CA, Columbus, OH, Dayton, OH or Richmond, VA  Type of environment: Office  Noise level: Medium  Work schedule: Schedule is day shift Monday – Friday. May be requested to work evenings and weekends to meet program and contract needs.  Amount of Travel: at least 10% \nPHYSICAL DEMANDS\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nWhile performing the duties of this job, the employee is regularly required to use hands to handle, feel, touch; reach with hands and arms; talk and hear. The employee is regularly required to stand; walk; sit; climb or balance; and stoop, kneel, crouch, or crawl. The employee is regularly required to lift up to 10 pounds. The employee is frequently required to lift up to 25 pounds; and up to 50 pounds. The vision requirements include close vision, distance vision, peripheral vision, depth perception, and ability to adjust focus.\n WORK AUTHORIZATION/SECURITY CLEARANCE \nUS Citizen\nSecret Clearance\nOther Duties\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n EQUAL EMPLOYMENT OPPORTUNITY \nIn order to provide equal employment and advancement opportunities to all individuals, employment decisions will be based on merit, qualifications, and abilities. TekSynap does not discriminate against any person because of race, color, creed, religion, sex, sexual orientation, gender identity, protected veteran status, national origin, disability, age, genetic information or any other characteristic protected by law (referred to as “protected status”). This nondiscrimination policy extends to all terms, conditions, and privileges of employment as well as the use of all company facilities, participation in all company-sponsored activities, and all employment actions such as promotions, compensation, benefits, and termination of employment.\nTekSynap is committed to ensuring that our online application process provides an equal employment opportunity to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to submit an application, please contact hr@teksynap.com for assistance.",
        "title": "Systems Engineer",
        "postTime": "2023-09-04 17:00:00 PDT",
        "postTimeSeconds": 1693872000.0
    },
    {
        "jobId": "3711942038",
        "jobUrl": "https://www.linkedin.com/jobs/view/3711942038",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:24629",
            "companyName": "Applicantz",
            "companyUrl": "https://www.linkedin.com/company/applicantz-com"
        },
        "description": "VISA SPONSORSHIP IS NOT AVAILABLE. This is Hybrid role, office is located in San Francisco downtown OR office in Atlanta OR office in Portland, OR.\nOur large, Fortune client is ranked as one of the best companies to work with, in the world. The client fosters progressive culture, creativity, and Flexible work environment. They use cutting edge technologies to keep themselves ahead of the curve. Diversity in all aspects is respected. Integrity, experience, honesty, people, humanity, and passion for excellence are some other adjectives that define this global technology leader.\nLooking for a talented engineer who is passionate about building and delivering innovative solutions to our common platform. As part of the E-commerce Engineering team, you will be implementing exciting new features that engage and influence the company's customers worldwide. Candidate needs to have a solid foundation in object-oriented programming, JavaScript modules, modern front-end frameworks, and a passion for the latest cloud technologies.\nRequirements:BA/BS degree or equivalent practical experience (MS in Computer Science or a related degree is preferred)Strong hands-on coding experience.Advanced knowledge of public cloud service platforms such as Amazon Web Services (AWS)Advanced knowledge in serverless technologies such as AWS Lambda5+ years of relevant industry experience in Node.js5+ years of relevant industry experience in React (or similar frameworks)Experience working with cross-functional stakeholdersExperience with scrum and agile development processes and methodologiesProactive, quick decision-maker with excellent communication and written skills\nResponsibilities:Architect and develop new featuresFocus on quality, including writing unit/integration tests and refactoring when appropriateBreak apart complex initiatives into manageable chunksWork closely with architects, technical leads, product owners, and others to drive toward a common visionLead and mentor the team to follow software engineering standards, including efficiency, quality, security, resiliency, and other best practicesDesign and build solutions, frameworks, automation, and orchestration for a broad range of applicationsProvide experience and support for the overall planning, execution, and success of complex technical projectsCollaborate with a distributed team and stakeholdersBe a passionate and empathetic advocate of architecture, design, and software engineering principles\nPreferred Qualifications:Expert knowledge in Frontend technologies is preferred.Advanced knowledge in architecting AWS-based systems.Strong hands-on experience with key technologies and tools such as CI/CDJavaScript modules and Object-Oriented ProgrammingAdvanced knowledge of relational databases",
        "title": "Full Stack Developer ReactJS NodeJS",
        "postTime": "2023-09-04 22:53:04 PDT",
        "postTimeSeconds": 1693893184.0
    },
    {
        "jobId": "3630477477",
        "jobUrl": "https://www.linkedin.com/jobs/view/3630477477",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:252398",
            "companyName": "ICE",
            "companyUrl": "https://www.linkedin.com/company/icemarkets"
        },
        "description": "Job Description\n\nJob Purpose\n\nICE Data Services, located in White Plains, NY is seeking a Software Developer to join our team of talented, creative and dedicated professionals.\n\nThis Developer is responsible for all phases of the project life-cycle activities, from initial analysis through production support including design, implementation, testing, integration, and maintenance.\n\nResponsibilities\nAssist technical & product managers in the evaluation of product requirements for software applications.Develop detailed specifications.Provide accurate and reliable estimates for project tasksApplication development, customization and integration of workDesign, code and unit test the applicationsMaintain/modify existing software applications with periodic releasesCreate test plans and test tools; support testing and address on-line bug reports/issuesDocument applications for technical white papers, user guides and operations guideBe available after normal working hours to support production problems and deployments\nKnowledge And Experience\nStrong C/C++ programming – 1+ yrs of development on Unix/Linux platforms.Experience with Linux/Unix and shell scripting exposureKnowledge of PythonExperience with Postgres, MySQL or other database technologiesUnderstanding complex systems and how to debug problemsExperience with debuggers such as GDB, and memory checkers such as ValgrindExperience with Source Control Management (CVS, GiT, SVN)Experience with unit testing and testing frameworksSDLC experience as applicable to current development group processesAbility to adhere to group standardsTeamwork - ability to work as project team member, work effectively with team leads, manager, as well as other groups including QA, Operations, and Product ManagementExcellent communication skillsBachelor’s Degree or equivalent in Computer Science or related field\nPluses\nUnderstand market data behavior across multiple asset classes (Equities, options, fixed income, and derivatives)UI development experience (Django framework or other relevant UI experience)\nSchedule\n\nThis role offers work from home flexibility of up to 2 days per week.\n\nBase Salary Range for New York Candidates\n\nThe expected base salary for this role is between $115,000 - 155,000. The base salary range does not include Intercontinental Exchange’s incentive compensation. While we provide this range as general guidance, at ICE we compensate employees based on the skillset and experience of the individual.\n\nIntercontinental Exchange, Inc. is an Equal Opportunity and Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, national origin or ancestry, age, disability or veteran status, or other protected status.",
        "title": "C++ Developer",
        "postTime": "2023-09-04 02:24:51 PDT",
        "postTimeSeconds": 1693819491.0
    },
    {
        "jobId": "3709929192",
        "jobUrl": "https://www.linkedin.com/jobs/view/3709929192",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:1480",
            "companyName": "Adobe",
            "companyUrl": "https://www.linkedin.com/company/adobe"
        },
        "description": "Our Company\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\nThe Opportunity \nThe Adobe Analytics platform processes 20+ billion transactions daily and delivers reporting data to customers worldwide. Our team is seeking a dedicated and passionate Software Engineer with top-notch technical, design and development skills to join our Analytics Reporting team in Lehi, Utah. In this role, you will collaborate closely with engineers, QA and Ops developing and testing the next generation of reliable, high-performance, scalable solutions. You will have the opportunity to develop solutions handling Big Data for enterprise customers worldwide.\nThis position is located in our Lehi, Utah office.\nWhat you'll Do \nDesign, build and maintain high performance scalable solutions for customers. Optimize and test existing software to enhance and improve performance, functionality and usability. Participate in all aspects of software development activities, including design, coding, code review, unit-testing, bug fixing, and operations. Collaborate with product management and engineering to help define and implement requirements for backend services, components and interfaces. Own development for features of large highly complex projects, and apply knowledge to implement architectural and feature specs to drive customer success through delivery of high quality code. Writing complete functional specification and documentation. Estimate schedules, breaking tasks down to reasonable 1-3 day tasks. Write, test and document well-structured code against designs which scale and perform well for customers worldwide. Identify outside technologies and when to use them. Make recommendations for system and process improvement. Invest time and energy to improve skills and knowledge. What you need to succeed \nBachelors or Masters Degree in computer science with at least 3 years working experience (or equivalent experience). Excellent in multi-threaded design and implementation. Proficient in c++ (including C++11) or Java, at least 2 years of experience. Experience with Linux, GIT, mySQL. Demonstrated mastery in software development and debuggingProficient in Test Driven Development. Experience desired with Big Data, streaming technologies, SaaS based environments, Web Analytics. Ability to quickly learn and apply complex subjects and technologies. Must be detail-oriented and demonstrate initiative and high self-motivation. Enthusiastic, creative and positive. Excellent interpersonal skills. Excellent English verbal and written communication skills. Highly collaborative working style. Our compensation reflects the cost of labor across several  U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this position is $101,500 -- $194,300 annually. Pay within this range varies by work location and may also depend on job-related knowledge, skills, and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.\nAt Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans. Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).\nIn addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.\nAdobe is proud to be an Equal Employment Opportunity and affirmative action employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.\nAdobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.\nAdobe values a free and open marketplace for all employees and has policies in place to ensure that we do not enter into illegal agreements with other companies to not recruit or hire each other’s employees.",
        "title": "Software Engineer 30",
        "postTime": "2023-09-04 20:26:18 PDT",
        "postTimeSeconds": 1693884378.0
    },
    {
        "jobId": "3630613849",
        "jobUrl": "https://www.linkedin.com/jobs/view/3630613849",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:6575553",
            "companyName": "ByteDance",
            "companyUrl": "https://www.linkedin.com/company/bytedance"
        },
        "description": "Responsibilities\nFounded in 2012, ByteDance's mission is to inspire creativity and enrich life. With a suite of more than a dozen products, including TikTok, Helo, and Resso, as well as platforms specific to the China market, including Toutiao, Douyin, and Xigua, ByteDance has made it easier and more fun for people to connect with, consume, and create content.\nWhy Join Us\nAt ByteDance, our people are humble, intelligent, compassionate and creative. We create to inspire - for you, for us, and for millions of users across all of our products. We lead with curiosity and aim for the highest, never shying away from taking calculated risks and embracing ambiguity as it comes. Here, the opportunities are limitless for those who dare to pursue bold ideas that exist just beyond the boundary of possibility. Join us and make impact happen with a career at ByteDance.\nThe mission of our AML team is to push next-generation machine learning algorithms and platform for the recommendation system, ads ranking and search ranking in our company. We also drive substantial impact for core businesses of the company. Currently we are looking for Full Stack Software Engineer - Machine Learning Infrastructure to join our team to support and advance that mission.\nWhat You'll Do\n Build platforms and services for internal teams to interact with the large scale ML systems. Manage and improve the pipeline of machine learning iteration, from training data management, model management, resource scheduling, push online for AB etc. Build tools and services to improve engineering productivity.\nQualifications\nQualifications\n BS degree in Computer Science, similar technical field of study or equivalent practical experience. Experience in a frontend development role, with solid JavaScript/HTML/CSS skills. Experience with one or more web frameworks (Vue/React/Angular). Experience with one or more general purpose programming languages including but not limited to: Java, C/C++, Python, or Go. Experience working with one or more of the following: web application development, Unix/Linux environments, distributed and parallel systems, networking systems, developing large software systems.\nPreferred Qualifications\n Familiarity with the whole web stack development. Experience of deploying machine learning pipelines, for example TFX.\nByteDance is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At ByteDance, our mission is to inspire creativity and enrich life. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.\nByteDance Inc. is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at kayla.wong@bytedance.com.\n\n\nJob Information:\n\n【For Pay Transparency】Compensation Description (annually)\nThe base salary range for this position in the selected city is $129960 - $246240 annually.\nCompensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.\nWe Offer The Following Benefits To Eligible Employees\nAt ByteDance/TikTok our benefits are designed to convey company culture and values, to create an efficient and inspiring work environment, and to support ByteDancers to give their best in both work and life.\nWe cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care.\nOur time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off(PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability.\nWe also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.",
        "title": "Full Stack Software Engineer - Machine Learning Infrastructure",
        "postTime": "2023-09-04 06:16:35 PDT",
        "postTimeSeconds": 1693833395.0
    }
]