[
    {
        "jobId": "3705615609",
        "status": "success",
        "jobUrl": "https://www.linkedin.com/jobs/view/3705615609",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:1035",
            "companyName": "Microsoft",
            "companyUrl": "https://www.linkedin.com/company/microsoft"
        },
        "description": "The Azure Quantum team is redefining what is possible with technology—creating unprecedented possibilities to solve humanity’s most complex challenges. Our team combines hardware innovation with software technologies and Azure services to build a scalable quantum computer in an industry-leading quantum ecosystem. We are looking to hire a Software Engineer to join our team.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n\nResponsibilities\n\nUnderstand User Requirements \nContributes in partnership with appropriate stakeholders (e.g., project manager, technical lead) to determine user requirements for a feature. Considers a variety of feedback channels to incorporate insights into future designs or solution fixes. Begins to incorporate appropriate continuous feedback loops measuring customer value, usage patterns, and other actionable metrics of value. \nDesign \nLearns and contributes to processes for the architecture of a product/solution feature and learns to create proposals by testing design hypotheses and helping to refine code plans under the technical leadership of others. Produces code to test hypotheses for technical solutions and assists with technical validation efforts. Helps with and participates in the development of design documents for simple designs or User Stories with oversight, helps to determine the technology that will be leveraged, and how they will interact. Escalates findings from investigations to team members for design decisions. Learns about the implications of security and compliance requirements in systems architecture. Collaborates with others to create a clear and articulated plan for testing and assuring quality of solutions. Helps to augment test cases and assures that features have good test coverage. Learns to integrate automation into testing during planning where applicable. Supports identification of dependencies, and the development of design documents for a product feature with oversight. Learns and helps to identify other teams and technologies that will be leveraged, how they will interact, and when one's system may provide support to others. Learns about back-end dependencies associated with product, application, service, or platform functionality for product features. Learns about downstream effects of solutions and work provided. \nCoding \nWith guidance, learns to create and implement code for a product, service, or feature reusing code as applicable. Writes and learns to create code that is extensible and maintainable. Learns about and applies diagnosability, reliability, and maintainability, and understands when the code is ready to be shared and delivered. Applies coding patterns and best practices to write code. Learns about and applies knowledge of debugging tools, logs, telemetry, and other methods to proactively flags issues before they occur and reactively flag issues as they occur for product features. Learns to conduct retrospective debugging of solutions to identify root causes of problems. Learns to review code and helps to review code of others to ensure it meets the team's and Microsoft's quality standards. Participates in code review processes for self-development, gathers feedback, and learns about coding standards and the team's features. Applies coding patterns and best practices. \nImplement \nLearns to review work items to gain knowledge of product features in partnership with appropriate stakeholders (e.g., project managers). Assists and learns about breaking down work items into tasks and provides estimation. Escalates any issues that would cause a delay. Learns about and supports deployment to customers following the correct measures to push features out to customers. Learns about and considers the impact of build deployments on both users and other services. Learns about best practices for the deployment of features safely. \nReliability and Supportability \nLearns about and contributes to operations of live service as issues arise on a rotational, on-call basis. Identifies solutions and mitigations to simple issues impacting performance or functionality of Live Site services and escalates as necessary. Acts as a Designated Responsible Individual (DRI) in monitoring system/product feature/service for degradation, downtime, or interruptions for simple problems, and recommends actions to restore system/product/service by following the playbook. Escalates more complex problems to other DRIs as to status. Responds within Service Level Agreement (SLA) timeframe. Escalates issues to appropriate owners. Learns to contribute to efforts to integrate instrumentation for gathering telemetry data on system behavior such as performance, reliability, availability, usage, and safety mechanisms. Supports the maintenance of feedback loops from telemetry resulting in subsequent designs. Learns to contribute to efforts to collect, classify, and analyze data with some oversight on a range of metrics (e.g., health of the system, where bugs might be occurring). Contributes to the refinement and integration of feedback in product features by escalating findings from analyses to inform decisions regarding the engineering of products. \nEngineering Excellence \nLearns about, shares new ideas, and leverages software developer tools to create, debug, and maintain code for features. Uses internal tools and open source when possible. Learns to develop and contribute to automation within production and deployment of a product feature. Runs code in simulated, or other non-production environments to confirm functionality and error-free runtime for products with oversight. Learns about and helps to ensure the correct processes are followed to achieve a high degree of security, privacy, safety, and accessibility. Contributes to efforts to check for visible evidence to demonstrate compliance for product features. Develops understanding of the implications of onboarding new technologies following expectations of compliance at Microsoft. Reviews current developments and proactively seeks new knowledge that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale. Develops knowledge of and learns to apply best practices to reliably build code that is based on well-established methods. Develops an understanding of global and local regulations for technologies and system applications. Learns about customer scaling requirements and application of best practices for meeting scaling needs and performance expectations. Learns about and helps to support communication with key partners across the Microsoft ecosystem of engineers. Supports partner teams across Microsoft (e.g., Xbox, Office) and supports projects to drive and achieve desirable user experiences and fitting the dynamic needs of partners/customers through product development. \nOther\nEmbody our culture and values \nQualifications\n\nRequired/Minimum Qualifications Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR equivalent experience. \nOther Requirements\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nAdditional Or Preferred QualificationsBachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR Master's Degree in Computer Science or Finish related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\n#Quantum\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
        "title": "Software Engineer",
        "postTime": "2023-09-05 14:39:16 PDT",
        "postTimeStamp": 1693949956.0
    },
    {
        "jobId": "3713337625",
        "status": "success",
        "jobUrl": "https://www.linkedin.com/jobs/view/3713337625",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:2433416",
            "companyName": "Chewy",
            "companyUrl": "https://www.linkedin.com/company/chewy-com"
        },
        "description": "Our Opportunity\nChewy is growing and we are looking to expand our merchandising systems and services team (MSS) with talented software engineers in multiple locations. If you are a Software Engineer and interested in building a platform from the ground up that will be highly impactful and visible to leadership at Chewy, please apply! This role may sit in any of our FL, WA, MA, or MN office locations and is not 100% remote, but we will be operating in a hybrid model once we return to the office.\nAbout You\nYou will be a software engineer with a BS in CS, or related degree/experience, focused on Full Stack Development; a focus on 60% Backend/40% FED. The MSS team is building a inhouse vendor portal platform that will have best in class security features, scale, and the capability to give our 2500+ vendors a great user experience for the 7+ Billion in digital inventory at Chewy. The platform is being built in Java, AWS, NodeJS, Angular and/or React but you will have an engineering foundation like this or will have the ability to adapt to build. This is a role that will support the creation & deployment of new concept prototypes related to application, system & services supporting standardization, optimization, automation, and process infrastructure of the Merchandising business & operations.\nAbout This Team\nOur team’s mission is to be the backbone for Chewy’s Category, Pricing & Vendor team by design, and develop world-class system prototypes helping them to win long-term customer trust, business growth, and profitability. This role will give you the chance to use your deep technical expertise to accelerate the adoption of the very best engineering practices, while maintaining knowledge on industry innovations, trends, and practices. You will help drive innovation, scalability, light-weight integrations, and maintainability while collaborating with our internal engineering/IT teams.\nWhat You Will Do\nDevelop System / Component prototypes (front & back end both) and APIs (Interact with the full application stack) for a rapidly scaling platform for vendor management, while ensuring successful product delivery and operational excellence Design, develop and implement large-scale distributed systems prototypes with large volumes of data, focusing on scalability, latency, and resiliency Prototype and develop new customer experiences for internal partners and external vendor applications with web technologiesDesign and build responsive, accessible and performant UX components for mobile and desktop web experiencesDevelop cloud native designs and implementation within public clouds, primarily AWSReview code, implementation and provide meaningful feedback that helps other prototype engineers to build better prototypes Experience in using DevOps principles and techniques to delivery high quality software prototypes with the least technical debt possible\nRequirements\nBachelor’s degree in Computer Science, or related field, or equivalent experience 4+ years of experience as a Software EngineerProject experience using Java, AWS, NodeJS, React, Angular, Vue.JS or similar frameworks and/or libraries. Solid CS Development experience will be considered.Ability to thrive in a fast paced, ambiguous, prototyping environment.High level of innovation and engineering creativity desired, this is a building role not a maintenance role.\nBonus experience (What skills you will gain in this role):\nUnderstanding of testing automation, including the building of scrappy coding/automation for testing code faster Experience in Retail, E-Commerce or Technology Industry, Merchandising & Vendor Management focus a plus Strong engineering background building Products/prototypes that are E-Commerce scale Experience in Software Quality Processes and Atlassian Tools (Confluence, JIRA, etc.)\nChewy is committed to equal opportunity. We value and embrace diversity and inclusion of all Team Members. If you have a disability under the Americans with Disabilities Act or similar law, and you need an accommodation during the application process or to perform these job requirements, or if you need a religious accommodation, please contact CAAR@chewy.com.\n\nIf you have a question regarding your application, please contact HR@chewy.com.\n\nTo access Chewy's Customer Privacy Policy, please click here. To access Chewy's California CPRA Job Applicant Privacy Policy, please click here.",
        "title": "Software Engineer II",
        "postTime": "2023-09-05 14:31:07 PDT",
        "postTimeStamp": 1693949467.0
    },
    {
        "jobId": "3705611377",
        "status": "success",
        "jobUrl": "https://www.linkedin.com/jobs/view/3705611377",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:2857634",
            "companyName": "Coinbase",
            "companyUrl": "https://www.linkedin.com/company/coinbase"
        },
        "description": "At Coinbase, our mission is to increase economic freedom around the world, and we couldn’t do this without hiring the best people. We’re a group of hard-working overachievers who are deeply focused on building the future of finance and Web3 for our users across the globe, whether they’re trading, storing, staking or using crypto. Know those people who always lead the group project? That’s us.\nThere are a few things we look for across all hires we make at Coinbase, regardless of role or team. First, we look for candidates who will thrive in a culture like ours, where we default to trust, embrace feedback, and disrupt ourselves. Second, we expect all employees to commit to our mission-focused approach to our work. Finally, we seek people who are excited to learn about and live crypto, because those are the folks who enjoy the intense moments in our sprint and recharge work culture. We’re a remote-first company looking to hire the absolute best talent all over the world.\nReady to ? Who you are:\nYou’ve got positive energy. You’re optimistic about the future and determined to get there. You’re never tired of learning. You want to be a pro in bleeding edge tech like DeFi, NFTs, DAOs, and Web 3.0. You appreciate direct communication. You’re both an active communicator and an eager listener - because let’s face it, you can’t have one without the other. You’re cool with candid feedback and see every setback as an opportunity to grow.You can pivot on the fly. Crypto is constantly evolving, so our priorities do, too. What you worked on last month may not be what you work on today, and that excites you. You’re not looking for a boring job.You have a “can do” attitude. Our teams create high-quality work on quick timelines. Owning a problem doesn’t scare you, but rather empowers you to take 100% responsibility for achieving our mission.You want to be part of a winning team. We’re stronger together, and you’re a person who embraces being pushed out of your comfort zone. \nWe are looking for a Software Engineer, Site Reliability to join our Observability team. The Observability team lives within our Infrastructure org in the Platform Product Group. The mission of the Platform Product Group is to build a trusted, scalable and compliant platform to operate with speed, efficiency and quality. Our teams build and maintain the platforms critical to the existence of Coinbase.\nAs a Software Engineer, Site Reliability on the Observability team, you'll be critical to helping us re-invent the observability stack at Coinbase as we continue to grow and scale 10X-100X.\nWhat You’ll Be Doing (ie. Job Duties)\nImprove observability, reliability and availability by defining and measuring key metricsBuild automation and improve systems to eliminate toil and operations work.Collaborate with our core infrastructure team to performance tune and optimize our cloud deployments. (Think Docker, Terraform, Kubernetes, EC2, etc.)Collaborate with Coinbase product teams to reduce service disruptions and automate incident responseProactively find and analyze reliability problems across our business units and stack, then design and implement software to create step-function improvements.Educate, mentor and hold accountable the engineering team to improve the reliability of our systems and make reliability a core value of the Coinbase engineering culture.\nWhat We Look For In You (ie. Job Requirements)\nYou have at least 3+ years of software engineering experienceStrong experience working with Object Oriented languages like Golang, Java, and or C#Skills around observability, debugging and performance tuningStrong communication skills and ability to explain technical concepts clearly and simplyStrong interpersonal skills working with engineers of all levelsDemonstrated critical thinking under pressure\nNice To Haves\nExperience designing and building reliable systems capable of handling high throughput and low latencyExperience with observability and monitoring systems such as Kibana, Datadog, etc.Experience working in a highly regulated environmentExposure to both NoSQL and SQL database technologies such as DynamoDB, MongoDB, PostgreSQL, AWS Aurora.Familiarity with working in rapid growth environments\nJob #: GSRE04NA\nPay Transparency Notice: Depending on your work location, the target annual salary for this position can range as detailed below. Full time offers from Coinbase also include target bonus + target equity + benefits (including medical, dental, vision and 401(k)).\nPay Range\n$140,250—$165,000 USD\nCommitment to Equal Opportunity\nCoinbase is committed to diversity in its workforce and is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law. For US applicants, you may view Pay Transparency, Employee Rights and Know Your Rights notices by clicking on their corresponding links. Additionally, Coinbase participates in the E-Verify program in certain locations, as required by law.\nCoinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to accommodations[at]coinbase.com and let us know the nature of your request and your contact information. For quick access to screen reading technology compatible with this site click here to download a free compatible screen reader (free step by step tutorial can be found here).\nGlobal Data Privacy Notice for Job Candidates and Applicants\nDepending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available here. By submitting your application, you are agreeing to our use and processing of your data as required. For US applicants only, by submitting your application you are agreeing to arbitration of disputes as outlined here.",
        "title": "Software Engineer, Site Reliability - Observability",
        "postTime": "2023-09-05 13:35:04 PDT",
        "postTimeStamp": 1693946104.0
    },
    {
        "jobId": "3675174189",
        "status": "success",
        "jobUrl": "https://www.linkedin.com/jobs/view/3675174189",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:24985",
            "companyName": "Supermicro",
            "companyUrl": "https://www.linkedin.com/company/supermicro"
        },
        "description": "Job Req ID: 22233\nAbout Supermicro\nSupermicro® is a Top Tier provider of advanced server, storage, and networking solutions for Data Center, Cloud Computing, Enterprise IT, Hadoop/ Big Data, Hyperscale, HPC and IoT/Embedded customers worldwide. We are the #5 fastest growing company among the Silicon Valley Top 50 technology firms. Our unprecedented global expansion has provided us with the opportunity to offer a large number of new positions to the technology community. We seek talented, passionate, and committed engineers, technologists, and business leaders to join us.\nJob Summary\nSupermicro is looking for a talented System Engineer to support the operation in our in-house validation lab. The individual will be working closely with internal team to conduct validation and functional testing on both motherboards and server products, perform server configuration and system performance testing to ensure the product is robust and durable. The ideal candidate must have solid understanding of server architecture and working knowledge of Linux and Windows operating system.\nEssential Duties And Responsibilities\nIncludes the following essential duties and responsibilities (other duties may also be assigned):\n Perform motherboard and server system application validation testing Conduct functional and compatibility testing on various operating systems such as Linux and Windows Perform motherboard and hardware functional validation testing Perform server configuration and system performance testing Report hardware and software quality assurance issues into bug tracking systems Duplicate customer's motherboard issue if needed Work with customers and product management to understand production use of the product and understand advanced functionality requirements\nQualifications\n Bachelor’s degree in Computer Science or equivalent experience preferred Minimum 3 years of working experience in testing/validate networking servers/data center is preferred Familiar with server and computer architecture Familiar with machine learning, deep learning Familiar with python programming Familiar with docker and virtual machine Familiar with distributed-system is preferred Familiar with Linux OS Familiar for HPC, data center, networking architecture, system mechanics, etc. Basic knowledge of networking/TCPIP Expert technical knowledge of designing and implementing Server system Knowledge of proper English usage, grammar, spelling, vocabulary, and of generally accepted office practices, procedures and equipment\nSalary Range\n$78,000 - $138,000\nThe salary offered will depend on several factors, including your location, level, education, training, specific skills, years of experience, and comparison to other employees already in this role. In addition to a comprehensive benefits package, candidates may be eligible for other forms of compensation, such as participation in bonus and equity award programs.\nEEO Statement\nSupermicro is an Equal Opportunity Employer and embraces diversity in our employee population. It is the policy of Supermicro to provide equal opportunity to all qualified applicants and employees without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status or special disabled veteran, marital status, pregnancy, genetic information, or any other legally protected status.",
        "title": "System Engineer",
        "postTime": "2023-09-05 13:48:12 PDT",
        "postTimeStamp": 1693946892.0
    },
    {
        "jobId": "3713120642",
        "status": "success",
        "jobUrl": "https://www.linkedin.com/jobs/view/3713120642",
        "companyDetails": {
            "companyId": "urn:li:fs_normalized_company:1855",
            "companyName": "Charles Schwab",
            "companyUrl": "https://www.linkedin.com/company/charles-schwab"
        },
        "description": "Your Opportunity\n\nYour Opportunity\n\nThis full-time role is part of a nine-month NERD (New Employee Recruitment and Development) program that blends on-the-job experience with an extensive training curriculum that covers tools, technologies, processes, and soft skills required to be successful in Schwab Technology Services. By pairing the curriculum, on-the-job experience, and web-of-support from others, NERDs are well prepared to succeed in their role which sets the table for future opportunities at Schwab.\n\nWhat you have\n\nWhat you will get out of the program\nMentorshipChallenging Career OpportunitiesContinuous Training and DevelopmentCertification OpportunitiesHands-on Technology ExperienceKnowledge Sharing and Presentation Opportunities Exposure to Leadership Community of Dedicated and Welcoming Peers\nWhat you’ll do\n\nAs a member of the NERD program, you will be working as an Associate Software Development Engineer on a small team to build the next generation of Schwab technology capabilities. You will be involved fully in the Software Development Lifecycle as you receive and evaluate feature requests, identify the best solution to implement features, code, test, and deploy changes. While coding will be part of your day-to-day workload, you will also be intently involved in the technology planning that will serve Schwab’s clients to be better equipped to own their financial future. We are interviewing for front-end, back-end, and full-stack positions across Schwab Technology Services.\n\nWhat you are good at\nYou enjoy problem solvingYou have a hunger for knowledgeYou work well with othersYou are a good communicator\nWhat you have\nUndergraduate or graduate degree in Computer Science, Management Information Systems, or related discipline with a graduation date of December 2023 or earlier and/orWorkforce training certifications through coding bootcamps with a graduation date of December 2023 or earlierAbility to start full-time with the program on January 22, 2024Knowledge of software development practices and processesFamiliarity with algorithm design and data structuresExperience with one or more of the following: Java, .NET, C#, HTML / CSS / JavaScript, SQL, NoSQL, or AngularFamiliarity with RESTful web services and / or Cloud APIs, a plusUX, Web development, or mobile development, a plusDatabase modeling, a plusInventiveness and eagerness to work with experimental technologyDemonstrated leadership potentialPassion and interest in solving problems applying innovation and experimentation \nWorkplace Flexibility Program\n\nWe're proud to support our employees in a working approach that allows you to bring your best self to work – whether that’s in the office or remote.\nEmployees will have the flexibility of a hybrid work environment, spending some time working remotely and sometimes in the office.Employees and managers can discuss and decide what works best for them, with additional flexibility available based on their role, business needs, and individual circumstances.Subject to change as Schwab is continually evaluating the current environment to best care for the safety and well-being of our employees.\nWhy work for us?\n\nOwn Your Tomorrow embodies everything we do! We are committed to helping our employees ignite their potential and achieve their dreams. Our employees get to play a vital role in reinventing a multi- trillion-dollar industry, creating a better, more modern way to build and manage wealth.\n\nBenefits: A competitive and flexible package designed to empower you for today and tomorrow. We offer a competitive and flexible package designed to help you make the most of your life at work and at home—today and in the future. Explore further.\n\nSchwab is committed to building a diverse and inclusive workplace where everyone feels valued. As an Equal Opportunity Employer, our policy is to provide equal employment opportunities to all employees and applicants without regard to any status protected by law. Please click here to see the policy. Schwab is an affirmative action employer, focused on advancing women, racial and ethnic minorities, veterans, and individuals with disabilities in the workplace. If you have a disability and require reasonable accommodations in the application process, contact Human Resources at applicantaccessibility@schwab.com or call 800-275-1281.\n\nTD Ameritrade, a subsidiary of Charles Schwab, is an Equal Opportunity Employer. At TD Ameritrade we believe People Matter. We value diversity and believe that it goes beyond all protected classes, thoughts, ideas, and perspectives.",
        "title": "Associate - Software Development & Engineer",
        "postTime": "2023-09-05 08:33:15 PDT",
        "postTimeStamp": 1693927995.0
    }
]